content/posts/Becoming_a_supple_leopard_by_Kelly_Starrett_in_2015.md
+++
title = "Becoming a supple leopard by Kelly Starrett in 2015"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:02-04:00
slug = "Becoming_a_supple_leopard_by_Kelly_Starrett_in_2015"
draft = false
+++

## I. Principles and theory {#i-dot-principles-and-theory}


### 1. Midline stabilization and organization (spinal mechanics) {#1-dot-midline-stabilization-and-organization--spinal-mechanics}


### 2. One-joint rule {#2-dot-one-joint-rule}


### 3. Laws of torque {#3-dot-laws-of-torque}


### 4. Body archetypes and the tunnel {#4-dot-body-archetypes-and-the-tunnel}


### 5. Movement hierarchy {#5-dot-movement-hierarchy}


### 6. Mobility: a systematic approach {#6-dot-mobility-a-systematic-approach}


## II. Categories of movement {#ii-dot-categories-of-movement}


### Category 1 {#category-1}

<!--list-separator-->

-  air squat

<!--list-separator-->

-  box squat

<!--list-separator-->

-  back squat

<!--list-separator-->

-  front squat

<!--list-separator-->

-  overhead squat

<!--list-separator-->

-  deadlift

<!--list-separator-->

-  pushup

<!--list-separator-->

-  bench press

<!--list-separator-->

-  dip

<!--list-separator-->

-  strict press

<!--list-separator-->

-  handstand pushup

<!--list-separator-->

-  pull-up


### Category 2 {#category-2}

<!--list-separator-->

-  wall ball

<!--list-separator-->

-  push-press

<!--list-separator-->

-  jumping and landing

<!--list-separator-->

-  kettlebell swing

<!--list-separator-->

-  one-arm swing

<!--list-separator-->

-  rowing

<!--list-separator-->

-  kipping pull-up

<!--list-separator-->

-  snatch balance progression


### Category 3 {#category-3}

<!--list-separator-->

-  burpee

<!--list-separator-->

-  Turkish getup

<!--list-separator-->

-  clean

<!--list-separator-->

-  jerk

<!--list-separator-->

-  snatch

<!--list-separator-->

-  muscle-up


## III. Mobilization techniques by area of body {#iii-dot-mobilization-techniques-by-area-of-body}


### 1. jaw, head, and neck {#1-dot-jaw-head-and-neck}


### 2. upper back {#2-dot-upper-back}


### 3. posterior shoulder, lat, serratus {#3-dot-posterior-shoulder-lat-serratus}


### 4. anterior shoulder and chest {#4-dot-anterior-shoulder-and-chest}


### 5. arm (triceps, elbow, forearm, wrist) {#5-dot-arm--triceps-elbow-forearm-wrist}


### 6. trunk (psoas, low back, obliques) {#6-dot-trunk--psoas-low-back-obliques}


### 7. glutes, hip capsules {#7-dot-glutes-hip-capsules}


### 8. hip flexors, quadriceps {#8-dot-hip-flexors-quadriceps}


### 9. adductors {#9-dot-adductors}


### 10. hamstrings {#10-dot-hamstrings}


### 11. knee {#11-dot-knee}


### 12. shin {#12-dot-shin}


### 13. calf {#13-dot-calf}


### 14. ankle, foot, and toes {#14-dot-ankle-foot-and-toes}


## IV. Mobility prescriptions {#iv-dot-mobility-prescriptions}


### 1. general overhead {#1-dot-general-overhead}


### 2. troubleshooting overhead {#2-dot-troubleshooting-overhead}


### 3. general press {#3-dot-general-press}


### 4. troubleshooting press {#4-dot-troubleshooting-press}


### 5. general hang {#5-dot-general-hang}


### 6. troubleshooting hang {#6-dot-troubleshooting-hang}


### 7. general front rack {#7-dot-general-front-rack}


### 8. troubleshooting front rack {#8-dot-troubleshooting-front-rack}


### 9. general squat {#9-dot-general-squat}


### 10. troubleshooting squat 1 {#10-dot-troubleshooting-squat-1}


### 11. troubleshooting squat 2 {#11-dot-troubleshooting-squat-2}


### 12. general pistol {#12-dot-general-pistol}


### 13. troubleshooting pistol {#13-dot-troubleshooting-pistol}


### 14. general lunge {#14-dot-general-lunge}


### 15. troubleshooting lunge {#15-dot-troubleshooting-lunge}


### 16. joint and body area prescriptions {#16-dot-joint-and-body-area-prescriptions}


### 17. 14-day whole body mobility overhaul {#17-dot-14-day-whole-body-mobility-overhaul}


### 18. 14-day whole-body sample programs {#18-dot-14-day-whole-body-sample-programs}
